# -*- coding:UTF-8 -*-
"""
 @Author: CNN
 @FileName: setting.py
 @DateTime: 2024/11/7 8:58
 @SoftWare: PyCharm
"""


INF = 1000
mysql_config = {
    'host': '192.168.101.144',
    'username': 'root',
    'password': 'wkfl.777',
    'port':3306
}
inter_dir = {"健康": [[(-1.8, 1.8), (-1.8, 1.8), (-1.1, 1.1), (-1.1, 1.1), (-1.5, 2.9)],
                      [(0, 2), (0, 2), (0, 1.5), (0, 1.5), (0, 0.5)],
                      [(0, 3.2), (0, 3.2), (0, 3.2), (0, 3.2), (0, 0.5)]],  # 积分电流，同步震动半径，同步电流的健康区间
             "预警": [[(1.8, INF), (1.8, INF), (1.8, INF), (1.8, INF), (2.9, INF)],
                      [(2.0, 2.9), (2.0, 2.9), (1.5, 2.9), (1.5, 2.9), (0.5, 2.9)],
                      [(3.2, 4), (3.2, 4), (3.2, 4), (3.2, 4), (0.5, 1)]],
             # 积分电流，同步震动半径，同步电流的预警区间
             "故障": [[(3.2, INF), (3.2, INF), (3.2, INF), (3.2, INF), (3.2, INF)],
                      [(2.9, INF), (2.9, INF), (2.9, INF), (2.9, INF), (2.9, INF)],
                      [(4, INF), (4, INF), (4, INF), (4, INF), (1, INF)]]}  # 积分电流，同步震动半径，同步电流的故障区间

# 统计分析历史数据
# TODO:修改状态与名称
states = ['健康', '预警', '故障']
tags = ['积分电流', '震动半径', '同步电流']